Public Member Functions | Static Public Member Functions | Public Attributes | List of all members
ACAPI::MEP::v1::Accessory Class Referencefinal
MEP Element Manager
The Accessory is a complex element with two ports on a single axis. More...
#include <MEPAccessory.hpp>
 Inheritance diagram for ACAPI::MEP::v1::Accessory:
 Public Member Functions
~Accessory ()
AccessoryDefault  | PickUpDefault () const
Picks up the Default from the Accessory.
Domain  | GetDomain () const
Returns the domain of the Accessory.
template<typename ModifierFunc >
Result< void >  | Modify (const ModifierFunc &modifierFunc, const GS::UniString &undoString)
Executes the passed modifier scope in an Undoable command.
Result< void >  | Inject (const AccessoryDefault &accessoryDefault)
Injects the Default settings into the Accessory.
 Public Member Functions inherited from ACAPI::MEP::v1::ModifiableElementBase
template<typename ModifierFunc >
Result< void >  | Modify (const ModifierFunc &modifierFunc, const GS::UniString &undoString)
Executes the passed modifier scope in an Undoable command.
~Modifier ()
void  | SetAnchorPoint (const API_Coord3D &anchorPoint)
Sets the anchor point of the ModifiableElement.
void  | SetOrientation (const MEP::Orientation &orientation)
Sets the orientation of the ModifiableElement.
void  | SetObjectId (const API_Guid &libraryPartId)
Sets the referenced library part of the ModifiableElement.
 Public Member Functions inherited from ACAPI::MEP::v1::ElementBase
bool  | Exists () const
std::vector< UniqueID >  | GetPortIDs () const
std::vector< UniqueID >  | GetDirectConnectedMEPElementIds () const
API_Coord3D  | GetAnchorPoint () const
Orientation  | GetOrientation () const
API_Guid  | GetObjectId () const
 Static Public Member Functions
static Result< Accessory >  | Get (const UniqueID &uniqueId)
Returns an Accessory.
 Public Attributes
friend  | Accessory
 Public Attributes inherited from ACAPI::MEP::v1::ModifiableElementBase
friend  | ModifiableElementBase
 Additional Inherited Members
 Protected Member Functions inherited from ACAPI::MEP::v1::ModifiableElementBase
ModifiableElementBase (std::shared_ptr< Impl::IElementBaseImpl >)
~ModifiableElementBase ()
Modifier (ModifiableElementBase &)
void  | FinalizeModification () override
 Protected Member Functions inherited from ACAPI::MEP::v1::ElementBase
ElementBase (std::shared_ptr< Impl::IElementBaseImpl >)
~ElementBase ()
Detailed Description
The Accessory is a complex element with two ports on a single axis.
Since
Archicad 27
Constructor & Destructor Documentation
◆ ~Accessory()
 ACAPI::MEP::v1::Accessory::~Accessory  |  ( |   | )
Member Function Documentation
◆ Get()
 static Result< Accessory > ACAPI::MEP::v1::Accessory::Get  |  ( |  const UniqueID &  |  uniqueId | )
static
Returns an Accessory.
Parameters
uniqueId | The UniqueID of the requested Accessory.
Returns
If the uniqueId belongs to an Accessory, returns the object associated to it, otherwise Error.
◆ GetDomain()
 Domain ACAPI::MEP::v1::Accessory::GetDomain  |  ( |   | ) |   const
Returns the domain of the Accessory.
Returns
The returned domain can be ventilation or piping.
◆ Inject()
 Result< void > ACAPI::MEP::v1::Accessory::Inject  |  ( |  const AccessoryDefault &  |  accessoryDefault | )
Injects the Default settings into the Accessory.
Parameters
accessoryDefault | The Default what will be injected. One should pay attention to the parameter, it has to belong to the same domain than the object it is called for.
Returns
Returns an error if the injection fails for some reason, otherwise nothing.
◆ Modify()
 template<typename ModifierFunc >
 Result< void > ACAPI::MEP::v1::Accessory::Modify  |  ( |  const ModifierFunc &  |  modifierFunc,
|  const GS::UniString &  |  undoString
)
Executes the passed modifier scope in an Undoable command.
Parameters
modifierFunc | The modifier scope (lambda, std::function or function pointer) the caller wants to execute.
undoString | The text which appears in the undo queue of Archicad after executing the command.
Returns
Returns an error if the process of modification fails for some reason, otherwise nothing.
◆ PickUpDefault()
 AccessoryDefault ACAPI::MEP::v1::Accessory::PickUpDefault  |  ( |   | ) |   const
Picks up the Default from the Accessory.
Returns
Returns an AccessoryDefault with the parameters of the object it was called for.
Member Data Documentation
◆ Accessory
 friend ACAPI::MEP::v1::Accessory::Accessory